NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_application.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_TRNG</name>
      <description>TRNG</description>
      <baseAddress>0x40059000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TRNG</name>
        <value>89</value>
      </interrupt>
      <groupName>TRNG</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>EVENTS_RNG</name>
          <description>Event indicating that interrupt triggered at RNG</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_RNG</name>
              <description>Event indicating that interrupt triggered at RNG</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNG</name>
              <description>Enable or disable interrupt for event RNG</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNG</name>
              <description>Write '1' to enable interrupt for event RNG</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNG</name>
              <description>Write '1' to disable interrupt for event RNG</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNG</name>
              <description>Read pending status of interrupt for event RNG</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable RNG peripheral module.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNG</name>
              <description>Enable RNG</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RNG disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RNG enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RNGCONTROL</name>
          <description>Unspecified</description>
          <headerStructName>TRNG_RNGCONTROL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>Control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00040000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Start/enable the NDRNG.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LFSREN</name>
                <description>Select between the NDRNG with asynchronous free running oscillators (when 0) and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when 1).</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TESTEN</name>
                <description>Select input for conditioning function and continuous tests:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Noise source (normal mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TEST</name>
                    <description>Test data register (test mode).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONDBYPASS</name>
                <description>Conditioning function bypass.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>the conditioning function is used (normal mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYPASS</name>
                    <description>the conditioning function is bypassed (to observe entropy source directly).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTENREP</name>
                <description>Enable interrupt if any of the health test fails.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>INTENFULL</name>
                <description>Enable interrupt if FIFO is full.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>SOFTRST</name>
                <description>Datapath content flush and control FSM</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>FORCEACTIVEROS</name>
                <description>Force oscillators to run when FIFO is full.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IGNOREHEALTHTESTSFAILFORFSM</name>
                <description>Results of the health tests during start-up and online test do not affect the control FSM state.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>NB128BITBLOCKS</name>
                <description>Number of 128 bit blocks used in conditioning (AES-CBC-MAC) post-processing.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>FIFOWRITESTARTUP</name>
                <description>Enable write of the samples in the FIFO during start-up.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>DISREPETTESTS</name>
                <description>All repetition tests (each share) are disabled via this single bit.</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>DISPROPTESTS</name>
                <description>All proportion tests (each share) are disabled via this single bit.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>DISAUTOCORRTESTS</name>
                <description>Disable specific delay(s) check in auto-correlation test - same RO:</description>
                <lsb>23</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>DISCORRTESTS</name>
                <description>Disable specific delay(s) check in correlation test - different ROs:</description>
                <lsb>27</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>BLENDINGMETHOD</name>
                <description>Select blending method</description>
                <lsb>30</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CONCATENATION</name>
                    <description>Concatenation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XORLEVEL1</name>
                    <description>XOR level 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XORLEVEL2</name>
                    <description>XOR level 2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VONNEUMANN</name>
                    <description>VON-NEUMANN debiasing</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FIFOLEVEL</name>
            <description>FIFO level register.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIFOLEVEL</name>
                <description>Number of 32 bits words of random values available in the FIFO.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FIFOTHRESHOLD</name>
            <description>FIFO threshold register.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIFOTHRESHOLD</name>
                <description>FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FIFODEPTH</name>
            <description>FIFO depth register.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIFODEPTH</name>
                <description>Maximum number of 32 bits words that can be stored in the FIFO.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>KEY[%s]</name>
            <description>Description collection: Key register.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>KEY</name>
                <description>Key register.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTDATA</name>
            <description>Test data register.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATA</name>
                <description>Test data register.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>REPEATTHRESHOLD</name>
            <description>Repetition test cut-off register.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>REPEATTHRESHOLD</name>
                <description>Repetition Test cut-off value.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PROPTESTCUTOFF</name>
            <description>Proportion test cut-off register.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000D</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PROPTESTCUTOFF</name>
                <description>Proportion test cut-off value.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LFSRSEED</name>
            <description>LFSR seed register.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LFSRSEED</name>
                <description>LFSR initialization value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>LFSRSSELECTION</name>
                <description>Share index for which initialization value should be used.</description>
                <lsb>24</lsb>
                <msb>25</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status register.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATABUSY</name>
                <description>High when data written to TestData register is being processed.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATE</name>
                <description>State of the control FSM:</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>Reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STARTUP</name>
                    <description>Startup</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IDLERON</name>
                    <description>Idle / FIFO full</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FILLFIFO</name>
                    <description>Fill FIFO</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ERROR</name>
                    <description>Error</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REPFAIL</name>
                <description>NIST repetition test(s) failure.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PROPFAIL</name>
                <description>NIST proportion test(s) failure.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ANYHEALTHTESTFAIL</name>
                <description>Any of the enabled health tests is failing.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FULLINT</name>
                <description>FIFO full status.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>STARTUPFAIL</name>
                <description>Start-up test(s) failure.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>REPTESTFAILPERSHARE</name>
                <description>NIST Repetition test failure per share.</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PROPTESTFAILPERSHARE</name>
                <description>NIST Proportion test failure per share.</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CONDITIONINGISTOOSLOW</name>
                <description>Conditioning consumes data slower than they are provided to it.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WARMUPPERIOD</name>
            <description>Number of clock cycles in warm-up sequence.</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000200</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WARMUPPERIOD</name>
                <description>Number of clock cycles in warm-up sequence.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
