NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_application.svd
          <register>
            <name>DISABLEOSC</name>
            <description>DisableOsc register.</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DISABLEOSC</name>
                <description>Disable oscillator rings 0 to 7.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLINGPERIOD</name>
            <description>Number of clock cycles between sampling moments.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000FFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLINGPERIOD</name>
                <description>Number of clock cycles between sampling moments.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWCONFIG</name>
            <description>Hardware configuration register.</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x0002410F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NBOFINV</name>
                <description>Generic g_NbOfInverters value.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LOG2NBOFAUTOCORRTESTSPERSHARE</name>
                <description>Generic g_Log2NbOfAutoCorrTestsPerShare value.</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LOG2FIFODEPTH</name>
                <description>Generic g_Log2FifoDepth value.</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LOG2NBOFSHARES</name>
                <description>Generic g_Log2NbOfShares value.</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COOLDOWNPERIOD</name>
            <description>Number of clock cycles in cool-down sequence.</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COOLDOWNPERIOD</name>
                <description>Number of clock cycles in cool-down sequence.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCORRTESTCUTOFF0</name>
            <description>AutoCorrTestCutoff register 0</description>
            <addressOffset>0x060</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DLYZEROCUTOFF</name>
                <description>Auto-correlation test cut-off value for delay of 0 samples.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>DLYONECUTOFF</name>
                <description>Auto-correlation test cut-off value for delay of +1 sample.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCORRTESTCUTOFF1</name>
            <description>AutoCorrTestCutoff register 1</description>
            <addressOffset>0x064</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DLYTWOCUTOFF</name>
                <description>Auto-correlation test cut-off value for delay of +2 samples.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>DLYTHREECUTOFF</name>
                <description>Auto-correlation test cut-off value for delay of +3 samples.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CORRTESTCUTOFF0</name>
            <description>CorrTestCutoff register 0</description>
            <addressOffset>0x068</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DLYZEROCUTOFF</name>
                <description>Correlation test cut-off value for delay of 0 samples.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>DLYONECUTOFF</name>
                <description>Correlation test cut-off value for delay of +/-1 sample.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CORRTESTCUTOFF1</name>
            <description>CorrTestCutoff register 1</description>
            <addressOffset>0x06C</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DLYTWOCUTOFF</name>
                <description>Correlation test cut-off value for delay of +/- 2 samples.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>DLYTHREECUTOFF</name>
                <description>Correlation test cut-off value for delay of +/- 3 samples.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCORRTESTFAILED</name>
            <description>Auto-correlation test failing ring(s).</description>
            <addressOffset>0x070</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AUTOCORRTESTFAILED</name>
                <description>Auto-correlation test failing ring(s).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CORRTESTFAILED</name>
            <description>Correlation test failing ring.</description>
            <addressOffset>0x074</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CORRTESTFAILED</name>
                <description>Correlation test failing ring.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HWVERSION</name>
            <description>Fixed to 1 for this version.</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HWVERSION</name>
                <description>Fixed to 1 for this version.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x20</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FIFO[%s]</name>
            <description>Description collection: FIFO data</description>
            <addressOffset>0x080</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>FIFO data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
